Courses/7140/Lectures/OODesign/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Object Oriented Design Principles: SOLID, &#x2026;</title>
<!-- 2018-10-30 Tue 13:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Mateti: OO Programming and Design"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2015-10-15 | <a href="../../"> ../../</a> | <a href="liskov-subst-principle-slides.html"> </a>
</div>
<div id="content">
<h1 class="title">Object Oriented Design Principles: SOLID, &#x2026;</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Data Encapsulation v Abstraction v OOD</a></li>
<li><a href="#sec-2">2. SOLID Principles of Class Design</a></li>
<li><a href="#sec-3">3. Principles of Package Cohesion</a></li>
<li><a href="#sec-4">4. Principles of Package Coupling</a></li>
<li><a href="#sec-5">5. Design By Contract (DoC)</a></li>
<li><a href="#sec-6">6. Liskov Substitution Principle (LSP)</a></li>
<li><a href="#sec-7">7. AntiPatterns</a></li>
<li><a href="#sec-8">8. References</a></li>
<li><a href="#sec-9">9. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Data Encapsulation v Abstraction v OOD</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Encapsulation</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>A "data structure" is declared.
</li>
<li>Certain operations are declared to be "public".
</li>
<li>The "data structure" is accessed/manipulated <b>only</b> via the above.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Abstraction</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>A "data type" is declared  
</li>
<li>Certain operations are available  
</li>
<li>The "data type" is an abstraction  
</li>
<li>Concrete representation to Abstraction mapping  
</li>
<li>E.g., an array of items ==&gt;  set of items  
</li>
<li>Information Hiding Principle
</li>
<li>Abstract Data Types v Classes
</li>
<li>Data Encapsulation v Data Abstraction
</li>
<li>See <a href="../Abstraction">../Abstraction</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Class Invariants</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Class invariants are assertions.
</li>
<li>Must be true before and after every public methods.
</li>
<li>Must be true after every constructor.
</li>
<li>See <a href="../Assertions">../Assertions</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> C++/Java/&#x2026; Classes</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Provide data encapsulation
</li>
<li>Do not do Data Abstraction
</li>
<li>Language Design
</li>
<li>public v protected v private
</li>
<li>interface v class
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> SOLID Principles of Class Design</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>(SRP) The Single Responsibility Principle
</li>

<li>(OCP) The Open Closed Principle: Classes and methods should be open
for extension (of functionality) and closed for modification.
</li>

<li>(LSP) The <a href="./liskov-subst-principle.html">Liskov Substitution Principle</a>.  Loosely stated: Subtypes
must be substitutable for super type.  A sub class must enhance
functionality, but not reduce.
</li>

<li>(ISP) The Interface Segregation Principle
</li>

<li>(DIP) The Dependency Inversion Principle
</li>

<li>Note that some argue that LSP is not an OOD principle.
</li>

<li>In this course: We replace the above with <a href="./design-by-contract.html">Design by Contract</a> This
is often confused with LSP.
</li>
<li>All the above in greater detail at <a href="./SOLID-principles.html">./SOLID-principles.html</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Principles of Package Cohesion</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>(REP) The Reuse Release Equivalence Principle
</li>
<li>(CCP) The Common Closure Principle
</li>
<li>(CRP) The Common Reuse Principle
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Principles of Package Coupling</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>(ADP) The Acyclic Dependencies Principle
</li>
<li>(SDP) The Stable Dependencies Principle
</li>
<li>(SAP) The Stable Abstractions Principle
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Design By Contract (DoC)</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="./design-by-contract.html">./design-by-contract.html</a>
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Liskov Substitution Principle (LSP)</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="./liskov-subst-principle.html">./liskov-subst-principle.html</a>
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> AntiPatterns</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>"An anti-pattern is a common response to a recurring problem that
is <b>usually ineffective</b> and risks being highly counterproductive."
</li>

<li><a href="./antipatterns.html">./antipatterns.html</a>
</li>
</ol>
</div>


<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Examples from non-CS</h3>
<div class="outline-text-3" id="text-7-1">
<ol class="org-ol">
<li>Bicycle shed: Giving disproportionate weight to trivial issues
</li>

<li>Escalation of commitment: Failing to revoke a decision when it proves wrong
</li>

<li>Peter Principle: Continually promoting otherwise well-performing
employees up to their level of incompetence, where they remain
indefinitely
</li>

<li>Stovepipe or Silos: An organizational structure of isolated or
semi-isolated teams, in which too many communications take place up
and down the hierarchy, rather than directly with other teams
across the organization
</li>

<li>Ninety-ninety rule: Tendency to underestimate the amount of time to
complete a project when it is "nearly done"
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Examples from Software engineering</h3>
<div class="outline-text-3" id="text-7-2">
<ol class="org-ol">
<li>Abstraction inversion: Not exposing implemented functionality
required by callers of a function/method/constructor, so that the
calling code awkwardly re-implements the same functionality in
terms of those calls
</li>

<li>Big ball of mud: A system with no recognizable structure.
</li>

<li>Input kludge: Failing to specify and implement the handling of
possibly invalid input
</li>

<li>Call super: Requiring subclasses to call a superclass's overridden
method
</li>

<li>God object: Concentrating too many functions in a single part of
the design (class)
</li>

<li>Sequential coupling: A class that requires its methods to be called
in a particular order. (?)
</li>

<li>Poltergeists: Objects whose sole purpose is to pass information to
another object
</li>

<li>Boat anchor: Retaining a part of a system that no longer has any
use
</li>

<li>Error hiding: Catching an error message before it can be shown to
the user and either showing nothing or showing a meaningless
message. Also can refer to erasing the Stack trace during
exception handling, which can hamper debugging.
</li>

<li>Lasagna code: Programs whose structure consists of too many layers.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> References</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>Web site, <a href="http://www.oodesign.com">http://www.oodesign.com</a> Includes pretty good descriptions
of the principles mentioned on this page.  Recommended Visit
</li>

<li><a href="https://en.wikipedia.org/wiki/Anti-pattern">https://en.wikipedia.org/wiki/Anti-pattern</a> A few selected items are
given above.  Software Engineering section: Required Reading.
</li>

<li><a href="https://sourcemaking.com/">https://sourcemaking.com/</a> has most of the above materials presented well.
</li>

<li><a href="http://antipatterns.com/">http://antipatterns.com/</a> Recommended Visit.
</li>

<li>Robert Bruce Findler, Mario Latendresse, and Matthias Felleisen.
Behavioral Contracts and Behavioral Subtyping.  In Proceedings of
ESEC/FSE-9, 229-236.
<a href="http://www.ccs.neu.edu/scheme/pubs/fse01-flf.pdf">http://www.ccs.neu.edu/scheme/pubs/fse01-flf.pdf</a> 2001 Recommended
Reading.
</li>

<li>Bertrand Meyer. Applying "Design by Contract".  IEEE Computer,
25(10):40–51, October 1992.
<a href="http://se.ethz.ch/~meyer/publications/computer/contract.pdf">http://se.ethz.ch/~meyer/publications/computer/contract.pdf</a> Also in
his book "Object-Oriented Software Construction".  Bertrand Meyer's
<a href="../OOD/meyer-design-by-contract-1992-markedUp.pdf">article marked-up</a> by pmateti Required Reading.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> End</h2>
<div class="outline-text-2" id="text-9">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2015 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> 2015-10-15
</div>
</body>
</html>
